<?php


/*
  Винница - без изменений
  Данная вакансия была размещена в газете "Трудоустройство" в Виннице.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Виннице можно не только на нашем сайте, но и купив газету "Трудоустройство" в Виннице в традиционных местах продажи прессы.

  Днепр:
  Данная вакансия была размещена в газете "Работа плюс Зарплата" в Днепре (Днепропетровске).
  Обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Работа плюс Зарплата".
  Найти работу в Днепре можно не только на нашем сайте, но и купив газету "Работа плюс Зарплата" и журнал "Работа в Кармане" в Днепре (Днепропетровске) в традиционных местах продажи прессы.

  Житомир
  Данная вакансия была размещена в газете "Трудоустройство" в Житомире.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Житомире можно не только на нашем сайте, но и купив газету "Трудоустройство" в Житомире в традиционных местах продажи прессы.

  Запорожье
  Данная вакансия была размещена в газете "Трудоустройство" в Запорожье.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Запорожье можно не только на нашем сайте, но и купив газету "Трудоустройство" и журнал "Работа в Кармане" в Запорожье в традиционных местах продажи прессы.

  Киев
  Данная вакансия была размещена в газете "Трудоустройство" в Киеве.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Киеве можно не только на нашем сайте, но и купив газету "Трудоустройство" и журнал "Работа в Кармане" в Киеве в традиционных местах продажи прессы.

  Краматорск
  Данная вакансия была размещена в газете "Трудоустройство" в Краматорске.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Краматорске можно не только на нашем сайте, но и купив газету "Трудоустройство" в Краматорске, Славянске, Дружковке, Константиновке в традиционных местах продажи прессы.

  Кропивницкий
  Данная вакансия была размещена в газете "Трудоустройство" в Кропивницком (Кировограде).
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Кропивницком можно не только на нашем сайте, но и купив газету "Трудоустройство" в Кропивницком в традиционных местах продажи прессы.

  Одесса
  Данная вакансия была размещена в газете "Трудоустройство" в Одессе.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство".
  Найти работу в Одессе можно не только на нашем сайте, но и купив газету "Трудоустройство" и журнал "Работа в Кармане" в Одессе в традиционных местах продажи прессы.

  Харьков
  Данная вакансия была размещена в журнале "Работа в Кармане" в Харькове.
  Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
  Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
  Эта вакнсия была проверена сотрудниками редакции журнала "Работа в Кармане".
  Найти работу в Харькове можно не только на нашем сайте, но и купив журнал "Работа в Кармане" в Харькове в традиционных местах продажи прессы.
 */


use MBCMS\DB;
use trud\classes\model\vacancies;
use trud\site_metrics;

class xml_parser implements ajax
{


    public static $postfix = [
        '419' => [
            'email' => 'od13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Одессе.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Одессе можно не только на нашем сайте, но и купив газету "Трудоустройство" и журнал "Работа в Кармане" в Одессе в традиционных местах продажи прессы.
            '),
            'name' => 'Одесса',
        ],
        '415' => [
            'email' => 'kv13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Киеве.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Киеве можно не только на нашем сайте, но и купив газету "Трудоустройство" и журнал "Работа в Кармане" в Киеве в традиционных местах продажи прессы.
            '),
            'name' => 'Киев',
        ],
        '433' => [
            'email' => 'zp13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Запорожье.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Запорожье можно не только на нашем сайте, но и купив газету "Трудоустройство" и журнал "Работа в Кармане" в Запорожье в традиционных местах продажи прессы.
            '),
            'name' => 'Запорожье',
        ],
        '417' => [
            'email' => 'dn13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Работа плюс Зарплата" в Днепре (Днепропетровске).
            Обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Работа плюс Зарплата"
            Найти работу в Днепре можно не только на нашем сайте, но и купив газету "Работа плюс Зарплата" и журнал "Работа в Кармане" в Днепре (Днепропетровске) в традиционных местах продажи прессы.
            '),
            'name' => 'Днепр',
        ],
        '416' => [
            'email' => 'kh13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в журнале "Работа в Кармане" в Харькове.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции журнала "Работа в Кармане"
            Найти работу в Харькове можно не только на нашем сайте, но и купив журнал "Работа в Кармане" в Харькове в традиционных местах продажи прессы.
        '),
            'name' => 'Харьков',
        ],
        '499' => [
            'email' => 'kram13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Краматорске.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Краматорске можно не только на нашем сайте, но и купив газету "Трудоустройство" в Краматорске, Славянске, Дружковке, Константиновке в традиционных местах продажи прессы.
            '),
            'name' => 'Краматорск',
        ],
        '428' => [
            'email' => 'vn13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Виннице.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Виннице можно не только на нашем сайте, но и купив газету "Трудоустройство" в Виннице в традиционных местах продажи прессы.
        '),
            'name' => 'Винница',
        ],
        '429' => [
            'email' => 'zh13@trud.net',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Житомире.
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Житомире можно не только на нашем сайте, но и купив газету "Трудоустройство" в Житомире в традиционных местах продажи прессы.
            '),
            'name' => 'Житомир',
        ],
        '437' => [
            'email' => 'p.karmatsky@mgg.ua',
            'desc' => ('
            Данная вакансия была размещена в газете "Трудоустройство" в Кропивницком (Кировограде).
            Если вас заинтересовала эта вакансия - обращайтесь к Работодателю только по телефону, указанному в этом обьявлении.
            Если хотите отправить резюме на электронную почту Работодателя - узнайте электронный адрес по телефону, указанному в этом объявлении.
            Эта вакнсия была проверена сотрудниками редакции газеты "Трудоустройство"
            Найти работу в Кропивницком можно не только на нашем сайте, но и купив газету "Трудоустройство" в Кропивницком в традиционных местах продажи прессы.
            '),
            'name' => 'Кропивницкий',
        ],
    ];


    private static $user_id;
    private static $city_id;
    private static $current_rubrica;
    private static $company_id;
    private static $__update_count = 0;
    private static $__add_count = 0;
    private static $__ids = [];

    public static function start($path, $city_id)
    {

        $xml = file_get_contents($path);

        $user_email = isset(self::$postfix[$city_id]['email']) ? self::$postfix[$city_id]['email'] : '';
        $city_name = isset(self::$postfix[$city_id]['name']) ? self::$postfix[$city_id]['name'] : '';

        $xml_data = new SimpleXMLElement($xml);

        $q = DB::q()->s(['*'], 't_users')->w('uname = ?', $user_email)->is_mono()->get();

        if ($q && preg_match('~' . $city_name . '~', $path))
        {
            self::$user_id = $q->id;
            self::$company_id = $q->companyid;
            self::$city_id = $city_id;

            self::__pars_xml_object($xml_data);
        }
        else
        {
            \MBCMS\form\form::errors([['Пользователя нет либо название файла не соответствует названию города!!! ' . $city_name . '  ' . $user_email]]);
        }

    }

    private static function __pars_xml_object($xml_data)
    {
        foreach ($xml_data as $key => $data)
        {
            if (preg_match('~Rubrika~', $key))
            {
                self::$current_rubrica = (string)$data;
                self::__pars_xml_object($data);
            }
            else if ($key == 'work_ord_txt' || $key == 'work_bld_txt')
            {
                $title = (string)$data->symb_bold;
                $dop = isset(self::$postfix[self::$city_id]['desc']) ? '<br><br>' . self::$postfix[self::$city_id]['desc'] : '';
                $desc = (string)$data . $dop;


                if ($title)
                {
                    $__q_vac_desc = DB::q()
                        ->s(['*'], 't_vacancies')
                        ->w('vacancydescription = ?', $desc)
                        ->w('title = ?', $title)
                        ->get();

                    if (!$__q_vac_desc)
                    {
                        self::write($title, $desc, self::$city_id, self::get_category_id(), self::$user_id, self::$company_id);
                    }
                    else
                    {
                        self::__update($__q_vac_desc);
                    }
                }
            }
            else if (is_object($data))
            {
                self::__pars_xml_object($data);
            }
        }
    }

    private static function __unodate($id)
    {
        DB::q()
            ->u(['added' => site_metrics::get_current_date(site_metrics::FORMAT_DATE_TIME)], 't_vacancies')
            ->w('id = ?', $id)
            ->get();
    }

    private static function __update($__q_vac_desc)
    {
        if (isset($__q_vac_desc->id))
        {
            self::__unodate($__q_vac_desc->id);
            self::$__update_count++;
        }
        else if ($__q_vac_desc && (is_object($__q_vac_desc) | is_array($__q_vac_desc)))
        {
            foreach ($__q_vac_desc as $vac)
            {
                if (isset($vac->id))
                {
                    self::__unodate($vac->id);
                    self::$__update_count++;
                }
            }
        }
    }

    private static function write($title, $desc, $city, $category, $user_id, $company_id)
    {
        if ($city && $category && $title && $user_id)
        {
            $array_lines['title'] = $title;
            $array_lines['vacancydescription'] = $desc;
            $array_lines['worktype'] = 1;
            $array_lines['salary'] = 0;
            $array_lines['adddate'] = site_metrics::get_current_date();
            $array_lines['added'] = site_metrics::get_current_date(site_metrics::FORMAT_DATE_TIME);
            $array_lines['visible'] = 1;
            $array_lines['ifpublish'] = 0;

            $__new_id = vacancies::factory()->add($array_lines, $user_id, $company_id, $title, explode(',', $category), $city);

            self::$__add_count++;
            self::$__ids['ADD'][] = $__new_id;
        }
    }

    private static function get_category_id()
    {
        $current_out_category = self::$current_rubrica;

        $id = preg_replace('~(\d+).*~', '$1', $current_out_category);

        $list = [
            '18' => '392,410',
            '13' => '423,408',
            '12' => '394,411,418,419',
            '16' => '394,405,428',
            '22' => '395',
            '25' => '395,398',
            '14' => '396,410,400',
            '26' => '397,398,413',
            '24' => '399',
            '27' => '401',
            '17' => '425',
            '28' => '403',
            '29' => '404',
            '15' => '405,428',
            '19' => '427',
            '21' => '427,406',
            '30' => '406,429',
            '20' => '412',
            '11' => '393,417',
            '23' => '416',
            '31' => '420',
        ];

        return isset($list[$id]) ? $list[$id] : null;
    }

}
